load-tests/load-test-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/surgeflow-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 3m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 002/200 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 002/200 VUs  0m00.9s/3m00.0s

running (0m01.9s), 004/200 VUs, 36 complete and 0 interrupted iterations
default   [   1% ] 004/200 VUs  0m01.9s/3m00.0s

running (0m02.9s), 005/200 VUs, 77 complete and 0 interrupted iterations
default   [   2% ] 005/200 VUs  0m02.9s/3m00.0s

running (0m02.9s), 005/200 VUs, 80 complete and 0 interrupted iterations
default   [   2% ] 005/200 VUs  0m02.9s/3m00.0s

running (0m03.9s), 007/200 VUs, 136 complete and 0 interrupted iterations
default   [   2% ] 007/200 VUs  0m03.9s/3m00.0s

running (0m04.9s), 009/200 VUs, 210 complete and 0 interrupted iterations
default   [   3% ] 009/200 VUs  0m04.9s/3m00.0s

running (0m05.9s), 010/200 VUs, 300 complete and 0 interrupted iterations
default   [   3% ] 010/200 VUs  0m05.9s/3m00.0s

running (0m06.9s), 012/200 VUs, 406 complete and 0 interrupted iterations
default   [   4% ] 012/200 VUs  0m06.9s/3m00.0s

running (0m07.9s), 013/200 VUs, 529 complete and 0 interrupted iterations
default   [   4% ] 013/200 VUs  0m07.9s/3m00.0s

running (0m08.9s), 015/200 VUs, 666 complete and 0 interrupted iterations
default   [   5% ] 015/200 VUs  0m08.9s/3m00.0s

running (0m09.9s), 017/200 VUs, 822 complete and 0 interrupted iterations
default   [   6% ] 017/200 VUs  0m09.9s/3m00.0s

running (0m10.9s), 018/200 VUs, 988 complete and 0 interrupted iterations
default   [   6% ] 018/200 VUs  0m10.9s/3m00.0s

running (0m11.9s), 020/200 VUs, 1175 complete and 0 interrupted iterations
default   [   7% ] 020/200 VUs  0m11.9s/3m00.0s

running (0m12.9s), 022/200 VUs, 1377 complete and 0 interrupted iterations
default   [   7% ] 022/200 VUs  0m12.9s/3m00.0s

running (0m13.9s), 023/200 VUs, 1596 complete and 0 interrupted iterations
default   [   8% ] 023/200 VUs  0m13.9s/3m00.0s

running (0m14.9s), 025/200 VUs, 1824 complete and 0 interrupted iterations
default   [   8% ] 025/200 VUs  0m14.9s/3m00.0s

running (0m15.9s), 026/200 VUs, 2062 complete and 0 interrupted iterations
default   [   9% ] 026/200 VUs  0m15.9s/3m00.0s

running (0m16.9s), 028/200 VUs, 2298 complete and 0 interrupted iterations
default   [   9% ] 028/200 VUs  0m16.9s/3m00.0s

running (0m17.9s), 030/200 VUs, 2582 complete and 0 interrupted iterations
default   [  10% ] 030/200 VUs  0m17.9s/3m00.0s

running (0m18.9s), 031/200 VUs, 2879 complete and 0 interrupted iterations
default   [  11% ] 031/200 VUs  0m18.9s/3m00.0s

running (0m19.9s), 033/200 VUs, 3190 complete and 0 interrupted iterations
default   [  11% ] 033/200 VUs  0m19.9s/3m00.0s

running (0m20.9s), 035/200 VUs, 3518 complete and 0 interrupted iterations
default   [  12% ] 035/200 VUs  0m20.9s/3m00.0s

running (0m21.9s), 036/200 VUs, 3858 complete and 0 interrupted iterations
default   [  12% ] 036/200 VUs  0m21.9s/3m00.0s

running (0m22.9s), 038/200 VUs, 4205 complete and 0 interrupted iterations
default   [  13% ] 038/200 VUs  0m22.9s/3m00.0s

running (0m23.9s), 040/200 VUs, 4578 complete and 0 interrupted iterations
default   [  13% ] 040/200 VUs  0m23.9s/3m00.0s

running (0m24.9s), 041/200 VUs, 4973 complete and 0 interrupted iterations
default   [  14% ] 041/200 VUs  0m24.9s/3m00.0s

running (0m25.9s), 043/200 VUs, 5374 complete and 0 interrupted iterations
default   [  14% ] 043/200 VUs  0m25.9s/3m00.0s

running (0m26.9s), 044/200 VUs, 5789 complete and 0 interrupted iterations
default   [  15% ] 044/200 VUs  0m26.9s/3m00.0s

running (0m27.9s), 046/200 VUs, 6228 complete and 0 interrupted iterations
default   [  16% ] 046/200 VUs  0m27.9s/3m00.0s

running (0m28.9s), 048/200 VUs, 6676 complete and 0 interrupted iterations
default   [  16% ] 048/200 VUs  0m28.9s/3m00.0s

running (0m29.9s), 049/200 VUs, 7145 complete and 0 interrupted iterations
default   [  17% ] 049/200 VUs  0m29.9s/3m00.0s

running (0m30.9s), 050/200 VUs, 7605 complete and 0 interrupted iterations
default   [  17% ] 050/200 VUs  0m30.9s/3m00.0s

running (0m31.9s), 051/200 VUs, 8070 complete and 0 interrupted iterations
default   [  18% ] 051/200 VUs  0m31.9s/3m00.0s

running (0m32.9s), 052/200 VUs, 8529 complete and 0 interrupted iterations
default   [  18% ] 052/200 VUs  0m32.9s/3m00.0s

running (0m33.9s), 053/200 VUs, 8954 complete and 0 interrupted iterations
default   [  19% ] 053/200 VUs  0m33.9s/3m00.0s

running (0m34.9s), 054/200 VUs, 9320 complete and 0 interrupted iterations
default   [  19% ] 054/200 VUs  0m34.9s/3m00.0s

running (0m35.9s), 054/200 VUs, 9831 complete and 0 interrupted iterations
default   [  20% ] 054/200 VUs  0m35.9s/3m00.0s

running (0m36.9s), 055/200 VUs, 10349 complete and 0 interrupted iterations
default   [  21% ] 055/200 VUs  0m36.9s/3m00.0s

running (0m37.9s), 056/200 VUs, 10879 complete and 0 interrupted iterations
default   [  21% ] 056/200 VUs  0m37.9s/3m00.0s

running (0m38.9s), 057/200 VUs, 11414 complete and 0 interrupted iterations
default   [  22% ] 057/200 VUs  0m38.9s/3m00.0s

running (0m39.9s), 058/200 VUs, 11964 complete and 0 interrupted iterations
default   [  22% ] 058/200 VUs  0m39.9s/3m00.0s

running (0m40.9s), 059/200 VUs, 12513 complete and 0 interrupted iterations
default   [  23% ] 059/200 VUs  0m40.9s/3m00.0s

running (0m41.9s), 059/200 VUs, 13034 complete and 0 interrupted iterations
default   [  23% ] 059/200 VUs  0m41.9s/3m00.0s

running (0m42.9s), 060/200 VUs, 13586 complete and 0 interrupted iterations
default   [  24% ] 060/200 VUs  0m42.9s/3m00.0s

running (0m43.9s), 061/200 VUs, 14174 complete and 0 interrupted iterations
default   [  24% ] 061/200 VUs  0m43.9s/3m00.0s

running (0m44.9s), 062/200 VUs, 14768 complete and 0 interrupted iterations
default   [  25% ] 062/200 VUs  0m44.9s/3m00.0s

running (0m45.9s), 063/200 VUs, 15373 complete and 0 interrupted iterations
default   [  26% ] 063/200 VUs  0m45.9s/3m00.0s

running (0m46.9s), 064/200 VUs, 15964 complete and 0 interrupted iterations
default   [  26% ] 064/200 VUs  0m46.9s/3m00.0s

running (0m47.9s), 064/200 VUs, 16588 complete and 0 interrupted iterations
default   [  27% ] 064/200 VUs  0m47.9s/3m00.0s

running (0m48.9s), 065/200 VUs, 17220 complete and 0 interrupted iterations
default   [  27% ] 065/200 VUs  0m48.9s/3m00.0s

running (0m49.9s), 066/200 VUs, 17851 complete and 0 interrupted iterations
default   [  28% ] 066/200 VUs  0m49.9s/3m00.0s

running (0m50.9s), 067/200 VUs, 18399 complete and 0 interrupted iterations
default   [  28% ] 067/200 VUs  0m50.9s/3m00.0s

running (0m51.9s), 068/200 VUs, 18966 complete and 0 interrupted iterations
default   [  29% ] 068/200 VUs  0m51.9s/3m00.0s

running (0m52.9s), 069/200 VUs, 19598 complete and 0 interrupted iterations
default   [  29% ] 069/200 VUs  0m52.9s/3m00.0s

running (0m53.9s), 069/200 VUs, 20265 complete and 0 interrupted iterations
default   [  30% ] 069/200 VUs  0m53.9s/3m00.0s

running (0m54.9s), 070/200 VUs, 20927 complete and 0 interrupted iterations
default   [  31% ] 070/200 VUs  0m54.9s/3m00.0s

running (0m55.9s), 071/200 VUs, 21614 complete and 0 interrupted iterations
default   [  31% ] 071/200 VUs  0m55.9s/3m00.0s

running (0m56.9s), 072/200 VUs, 22293 complete and 0 interrupted iterations
default   [  32% ] 072/200 VUs  0m56.9s/3m00.0s

running (0m57.9s), 073/200 VUs, 22972 complete and 0 interrupted iterations
default   [  32% ] 073/200 VUs  0m57.9s/3m00.0s

running (0m58.9s), 074/200 VUs, 23658 complete and 0 interrupted iterations
default   [  33% ] 074/200 VUs  0m58.9s/3m00.0s

running (0m59.9s), 074/200 VUs, 24378 complete and 0 interrupted iterations
default   [  33% ] 074/200 VUs  0m59.9s/3m00.0s

running (1m00.9s), 075/200 VUs, 25089 complete and 0 interrupted iterations
default   [  34% ] 075/200 VUs  1m00.9s/3m00.0s

running (1m01.9s), 076/200 VUs, 25804 complete and 0 interrupted iterations
default   [  34% ] 076/200 VUs  1m01.9s/3m00.0s

running (1m02.9s), 077/200 VUs, 26533 complete and 0 interrupted iterations
default   [  35% ] 077/200 VUs  1m02.9s/3m00.0s

running (1m03.9s), 078/200 VUs, 27259 complete and 0 interrupted iterations
default   [  36% ] 078/200 VUs  1m03.9s/3m00.0s

running (1m04.9s), 079/200 VUs, 28004 complete and 0 interrupted iterations
default   [  36% ] 079/200 VUs  1m04.9s/3m00.0s

running (1m05.9s), 079/200 VUs, 28758 complete and 0 interrupted iterations
default   [  37% ] 079/200 VUs  1m05.9s/3m00.0s

running (1m06.9s), 080/200 VUs, 29490 complete and 0 interrupted iterations
default   [  37% ] 080/200 VUs  1m06.9s/3m00.0s

running (1m07.9s), 081/200 VUs, 30256 complete and 0 interrupted iterations
default   [  38% ] 081/200 VUs  1m07.9s/3m00.0s

running (1m08.9s), 082/200 VUs, 30901 complete and 0 interrupted iterations
default   [  38% ] 082/200 VUs  1m08.9s/3m00.0s

running (1m10.0s), 083/200 VUs, 31571 complete and 0 interrupted iterations
default   [  39% ] 083/200 VUs  1m09.9s/3m00.0s

running (1m10.9s), 084/200 VUs, 32177 complete and 0 interrupted iterations
default   [  39% ] 084/200 VUs  1m10.9s/3m00.0s

running (1m11.9s), 084/200 VUs, 32960 complete and 0 interrupted iterations
default   [  40% ] 084/200 VUs  1m11.9s/3m00.0s

running (1m12.9s), 085/200 VUs, 33757 complete and 0 interrupted iterations
default   [  41% ] 085/200 VUs  1m12.9s/3m00.0s

running (1m13.9s), 086/200 VUs, 34579 complete and 0 interrupted iterations
default   [  41% ] 086/200 VUs  1m13.9s/3m00.0s

running (1m14.9s), 087/200 VUs, 35380 complete and 0 interrupted iterations
default   [  42% ] 087/200 VUs  1m14.9s/3m00.0s

running (1m15.9s), 088/200 VUs, 36219 complete and 0 interrupted iterations
default   [  42% ] 088/200 VUs  1m15.9s/3m00.0s

running (1m16.9s), 089/200 VUs, 37017 complete and 0 interrupted iterations
default   [  43% ] 089/200 VUs  1m16.9s/3m00.0s

running (1m17.9s), 089/200 VUs, 37864 complete and 0 interrupted iterations
default   [  43% ] 089/200 VUs  1m17.9s/3m00.0s

running (1m18.9s), 090/200 VUs, 38712 complete and 0 interrupted iterations
default   [  44% ] 090/200 VUs  1m18.9s/3m00.0s

running (1m19.9s), 091/200 VUs, 39580 complete and 0 interrupted iterations
default   [  44% ] 091/200 VUs  1m19.9s/3m00.0s

running (1m20.9s), 092/200 VUs, 40451 complete and 0 interrupted iterations
default   [  45% ] 092/200 VUs  1m20.9s/3m00.0s

running (1m21.9s), 093/200 VUs, 41328 complete and 0 interrupted iterations
default   [  46% ] 093/200 VUs  1m21.9s/3m00.0s

running (1m22.9s), 094/200 VUs, 42170 complete and 0 interrupted iterations
default   [  46% ] 094/200 VUs  1m22.9s/3m00.0s

running (1m23.9s), 094/200 VUs, 43051 complete and 0 interrupted iterations
default   [  47% ] 094/200 VUs  1m23.9s/3m00.0s

running (1m24.9s), 095/200 VUs, 43961 complete and 0 interrupted iterations
default   [  47% ] 095/200 VUs  1m24.9s/3m00.0s

running (1m25.9s), 096/200 VUs, 44840 complete and 0 interrupted iterations
default   [  48% ] 096/200 VUs  1m25.9s/3m00.0s

running (1m26.9s), 097/200 VUs, 45606 complete and 0 interrupted iterations
default   [  48% ] 097/200 VUs  1m26.9s/3m00.0s

running (1m27.9s), 098/200 VUs, 46322 complete and 0 interrupted iterations
default   [  49% ] 098/200 VUs  1m27.9s/3m00.0s

running (1m28.9s), 099/200 VUs, 46944 complete and 0 interrupted iterations
default   [  49% ] 099/200 VUs  1m28.9s/3m00.0s

running (1m29.9s), 099/200 VUs, 47836 complete and 0 interrupted iterations
default   [  50% ] 099/200 VUs  1m29.9s/3m00.0s

running (1m30.9s), 101/200 VUs, 48734 complete and 0 interrupted iterations
default   [  51% ] 101/200 VUs  1m30.9s/3m00.0s

running (1m31.9s), 103/200 VUs, 49662 complete and 0 interrupted iterations
default   [  51% ] 103/200 VUs  1m31.9s/3m00.0s

running (1m32.9s), 104/200 VUs, 50625 complete and 0 interrupted iterations
default   [  52% ] 104/200 VUs  1m32.9s/3m00.0s

running (1m33.9s), 106/200 VUs, 51586 complete and 0 interrupted iterations
default   [  52% ] 106/200 VUs  1m33.9s/3m00.0s

running (1m34.9s), 108/200 VUs, 52517 complete and 0 interrupted iterations
default   [  53% ] 108/200 VUs  1m34.9s/3m00.0s

running (1m35.9s), 109/200 VUs, 53505 complete and 0 interrupted iterations
default   [  53% ] 109/200 VUs  1m35.9s/3m00.0s

running (1m36.9s), 111/200 VUs, 54488 complete and 0 interrupted iterations
default   [  54% ] 111/200 VUs  1m36.9s/3m00.0s

running (1m37.9s), 113/200 VUs, 55421 complete and 0 interrupted iterations
default   [  54% ] 113/200 VUs  1m37.9s/3m00.0s

running (1m38.9s), 114/200 VUs, 56378 complete and 0 interrupted iterations
default   [  55% ] 114/200 VUs  1m38.9s/3m00.0s

running (1m39.9s), 116/200 VUs, 57421 complete and 0 interrupted iterations
default   [  56% ] 116/200 VUs  1m39.9s/3m00.0s

running (1m40.9s), 118/200 VUs, 58456 complete and 0 interrupted iterations
default   [  56% ] 118/200 VUs  1m40.9s/3m00.0s

running (1m41.9s), 119/200 VUs, 59477 complete and 0 interrupted iterations
default   [  57% ] 119/200 VUs  1m41.9s/3m00.0s

running (1m42.9s), 121/200 VUs, 60525 complete and 0 interrupted iterations
default   [  57% ] 121/200 VUs  1m42.9s/3m00.0s

running (1m43.9s), 123/200 VUs, 61535 complete and 0 interrupted iterations
default   [  58% ] 123/200 VUs  1m43.9s/3m00.0s

running (1m44.9s), 124/200 VUs, 62462 complete and 0 interrupted iterations
default   [  58% ] 124/200 VUs  1m44.9s/3m00.0s

running (1m45.9s), 126/200 VUs, 63035 complete and 0 interrupted iterations
default   [  59% ] 126/200 VUs  1m45.9s/3m00.0s

running (1m46.9s), 128/200 VUs, 63667 complete and 0 interrupted iterations
default   [  59% ] 128/200 VUs  1m46.9s/3m00.0s

running (1m47.9s), 129/200 VUs, 64608 complete and 0 interrupted iterations
default   [  60% ] 129/200 VUs  1m47.9s/3m00.0s

running (1m48.9s), 131/200 VUs, 65689 complete and 0 interrupted iterations
default   [  61% ] 131/200 VUs  1m48.9s/3m00.0s

running (1m49.9s), 133/200 VUs, 66843 complete and 0 interrupted iterations
default   [  61% ] 133/200 VUs  1m49.9s/3m00.0s

running (1m50.9s), 134/200 VUs, 67967 complete and 0 interrupted iterations
default   [  62% ] 134/200 VUs  1m50.9s/3m00.0s

running (1m51.9s), 136/200 VUs, 69073 complete and 0 interrupted iterations
default   [  62% ] 136/200 VUs  1m51.9s/3m00.0s

running (1m52.9s), 138/200 VUs, 70250 complete and 0 interrupted iterations
default   [  63% ] 138/200 VUs  1m52.9s/3m00.0s

running (1m53.9s), 139/200 VUs, 71402 complete and 0 interrupted iterations
default   [  63% ] 139/200 VUs  1m53.9s/3m00.0s

running (1m54.9s), 141/200 VUs, 72551 complete and 0 interrupted iterations
default   [  64% ] 141/200 VUs  1m54.9s/3m00.0s

running (1m55.9s), 143/200 VUs, 73703 complete and 0 interrupted iterations
default   [  64% ] 143/200 VUs  1m55.9s/3m00.0s

running (1m56.9s), 144/200 VUs, 74912 complete and 0 interrupted iterations
default   [  65% ] 144/200 VUs  1m56.9s/3m00.0s

running (1m57.9s), 146/200 VUs, 75989 complete and 0 interrupted iterations
default   [  66% ] 146/200 VUs  1m57.9s/3m00.0s

running (1m58.9s), 148/200 VUs, 77177 complete and 0 interrupted iterations
default   [  66% ] 148/200 VUs  1m58.9s/3m00.0s

running (1m59.9s), 149/200 VUs, 78324 complete and 0 interrupted iterations
default   [  67% ] 149/200 VUs  1m59.9s/3m00.0s

running (2m00.9s), 151/200 VUs, 79521 complete and 0 interrupted iterations
default   [  67% ] 151/200 VUs  2m00.9s/3m00.0s

running (2m01.9s), 153/200 VUs, 80640 complete and 0 interrupted iterations
default   [  68% ] 153/200 VUs  2m01.9s/3m00.0s

running (2m02.9s), 154/200 VUs, 81818 complete and 0 interrupted iterations
default   [  68% ] 154/200 VUs  2m02.9s/3m00.0s

running (2m03.9s), 156/200 VUs, 82511 complete and 0 interrupted iterations
default   [  69% ] 156/200 VUs  2m03.9s/3m00.0s

running (2m05.0s), 158/200 VUs, 83329 complete and 0 interrupted iterations
default   [  69% ] 158/200 VUs  2m05.0s/3m00.0s

running (2m05.9s), 159/200 VUs, 84150 complete and 0 interrupted iterations
default   [  70% ] 159/200 VUs  2m05.9s/3m00.0s

running (2m06.9s), 161/200 VUs, 85248 complete and 0 interrupted iterations
default   [  71% ] 161/200 VUs  2m06.9s/3m00.0s

running (2m07.9s), 163/200 VUs, 86261 complete and 0 interrupted iterations
default   [  71% ] 163/200 VUs  2m07.9s/3m00.0s

running (2m08.9s), 164/200 VUs, 87298 complete and 0 interrupted iterations
default   [  72% ] 164/200 VUs  2m08.9s/3m00.0s

running (2m09.9s), 166/200 VUs, 88550 complete and 0 interrupted iterations
default   [  72% ] 166/200 VUs  2m09.9s/3m00.0s

running (2m10.9s), 168/200 VUs, 89678 complete and 0 interrupted iterations
default   [  73% ] 168/200 VUs  2m10.9s/3m00.0s

running (2m11.9s), 169/200 VUs, 90835 complete and 0 interrupted iterations
default   [  73% ] 169/200 VUs  2m11.9s/3m00.0s

running (2m12.9s), 171/200 VUs, 92077 complete and 0 interrupted iterations
default   [  74% ] 171/200 VUs  2m12.9s/3m00.0s

running (2m13.9s), 173/200 VUs, 93340 complete and 0 interrupted iterations
default   [  74% ] 173/200 VUs  2m13.9s/3m00.0s

running (2m14.9s), 174/200 VUs, 94544 complete and 0 interrupted iterations
default   [  75% ] 174/200 VUs  2m14.9s/3m00.0s

running (2m15.9s), 176/200 VUs, 95775 complete and 0 interrupted iterations
default   [  76% ] 176/200 VUs  2m15.9s/3m00.0s

running (2m16.9s), 178/200 VUs, 96995 complete and 0 interrupted iterations
default   [  76% ] 178/200 VUs  2m16.9s/3m00.0s

running (2m17.9s), 179/200 VUs, 98208 complete and 0 interrupted iterations
default   [  77% ] 179/200 VUs  2m17.9s/3m00.0s

running (2m19.0s), 181/200 VUs, 99418 complete and 0 interrupted iterations
default   [  77% ] 181/200 VUs  2m19.0s/3m00.0s

running (2m19.9s), 183/200 VUs, 100666 complete and 0 interrupted iterations
default   [  78% ] 183/200 VUs  2m19.9s/3m00.0s

running (2m20.9s), 184/200 VUs, 101865 complete and 0 interrupted iterations
default   [  78% ] 184/200 VUs  2m20.9s/3m00.0s

running (2m21.9s), 186/200 VUs, 102862 complete and 0 interrupted iterations
default   [  79% ] 186/200 VUs  2m21.9s/3m00.0s

running (2m23.0s), 188/200 VUs, 103664 complete and 0 interrupted iterations
default   [  79% ] 188/200 VUs  2m23.0s/3m00.0s

running (2m23.9s), 189/200 VUs, 104379 complete and 0 interrupted iterations
default   [  80% ] 189/200 VUs  2m23.9s/3m00.0s

running (2m24.9s), 191/200 VUs, 105151 complete and 0 interrupted iterations
default   [  81% ] 191/200 VUs  2m24.9s/3m00.0s

running (2m25.9s), 193/200 VUs, 106343 complete and 0 interrupted iterations
default   [  81% ] 193/200 VUs  2m25.9s/3m00.0s

running (2m26.9s), 194/200 VUs, 107551 complete and 0 interrupted iterations
default   [  82% ] 194/200 VUs  2m26.9s/3m00.0s

running (2m27.9s), 196/200 VUs, 108737 complete and 0 interrupted iterations
default   [  82% ] 196/200 VUs  2m27.9s/3m00.0s

running (2m28.9s), 198/200 VUs, 110044 complete and 0 interrupted iterations
default   [  83% ] 198/200 VUs  2m28.9s/3m00.0s

running (2m29.9s), 199/200 VUs, 111326 complete and 0 interrupted iterations
default   [  83% ] 199/200 VUs  2m29.9s/3m00.0s

running (2m30.9s), 196/200 VUs, 112561 complete and 0 interrupted iterations
default   [  84% ] 196/200 VUs  2m30.9s/3m00.0s

running (2m31.9s), 189/200 VUs, 113898 complete and 0 interrupted iterations
default   [  84% ] 189/200 VUs  2m31.9s/3m00.0s

running (2m32.9s), 182/200 VUs, 115024 complete and 0 interrupted iterations
default   [  85% ] 182/200 VUs  2m32.9s/3m00.0s

running (2m33.9s), 175/200 VUs, 116231 complete and 0 interrupted iterations
default   [  86% ] 175/200 VUs  2m33.9s/3m00.0s

running (2m34.9s), 168/200 VUs, 117357 complete and 0 interrupted iterations
default   [  86% ] 168/200 VUs  2m34.9s/3m00.0s

running (2m35.9s), 162/200 VUs, 118621 complete and 0 interrupted iterations
default   [  87% ] 162/200 VUs  2m35.9s/3m00.0s

running (2m36.9s), 155/200 VUs, 119831 complete and 0 interrupted iterations
default   [  87% ] 155/200 VUs  2m36.9s/3m00.0s

running (2m37.9s), 148/200 VUs, 120966 complete and 0 interrupted iterations
default   [  88% ] 148/200 VUs  2m37.9s/3m00.0s

running (2m38.9s), 142/200 VUs, 122164 complete and 0 interrupted iterations
default   [  88% ] 142/200 VUs  2m38.9s/3m00.0s

running (2m39.9s), 135/200 VUs, 123351 complete and 0 interrupted iterations
default   [  89% ] 135/200 VUs  2m39.9s/3m00.0s

running (2m40.9s), 128/200 VUs, 124283 complete and 0 interrupted iterations
default   [  89% ] 128/200 VUs  2m40.9s/3m00.0s

running (2m41.9s), 121/200 VUs, 125166 complete and 0 interrupted iterations
default   [  90% ] 121/200 VUs  2m41.9s/3m00.0s

running (2m43.0s), 115/200 VUs, 125796 complete and 0 interrupted iterations
default   [  91% ] 115/200 VUs  2m42.9s/3m00.0s

running (2m43.9s), 108/200 VUs, 126427 complete and 0 interrupted iterations
default   [  91% ] 108/200 VUs  2m43.9s/3m00.0s

running (2m44.9s), 101/200 VUs, 127394 complete and 0 interrupted iterations
default   [  92% ] 101/200 VUs  2m44.9s/3m00.0s

running (2m45.9s), 095/200 VUs, 128339 complete and 0 interrupted iterations
default   [  92% ] 095/200 VUs  2m45.9s/3m00.0s

running (2m46.9s), 088/200 VUs, 129192 complete and 0 interrupted iterations
default   [  93% ] 088/200 VUs  2m46.9s/3m00.0s

running (2m47.9s), 082/200 VUs, 130017 complete and 0 interrupted iterations
default   [  93% ] 082/200 VUs  2m47.9s/3m00.0s

running (2m48.9s), 075/200 VUs, 130747 complete and 0 interrupted iterations
default   [  94% ] 075/200 VUs  2m48.9s/3m00.0s

running (2m49.9s), 068/200 VUs, 131435 complete and 0 interrupted iterations
default   [  94% ] 068/200 VUs  2m49.9s/3m00.0s

running (2m50.9s), 062/200 VUs, 132056 complete and 0 interrupted iterations
default   [  95% ] 062/200 VUs  2m50.9s/3m00.0s

running (2m51.9s), 055/200 VUs, 132634 complete and 0 interrupted iterations
default   [  96% ] 055/200 VUs  2m51.9s/3m00.0s

running (2m52.9s), 048/200 VUs, 133134 complete and 0 interrupted iterations
default   [  96% ] 048/200 VUs  2m52.9s/3m00.0s

running (2m53.9s), 041/200 VUs, 133574 complete and 0 interrupted iterations
default   [  97% ] 041/200 VUs  2m53.9s/3m00.0s

running (2m54.9s), 035/200 VUs, 133950 complete and 0 interrupted iterations
default   [  97% ] 035/200 VUs  2m54.9s/3m00.0s

running (2m55.9s), 028/200 VUs, 134263 complete and 0 interrupted iterations
default   [  98% ] 028/200 VUs  2m55.9s/3m00.0s

running (2m56.9s), 021/200 VUs, 134507 complete and 0 interrupted iterations
default   [  98% ] 021/200 VUs  2m56.9s/3m00.0s

running (2m57.9s), 015/200 VUs, 134686 complete and 0 interrupted iterations
default   [  99% ] 015/200 VUs  2m57.9s/3m00.0s

running (2m58.9s), 008/200 VUs, 134800 complete and 0 interrupted iterations
default   [  99% ] 008/200 VUs  2m58.9s/3m00.0s

running (2m59.9s), 002/200 VUs, 134850 complete and 0 interrupted iterations
default   [ 100% ] 002/200 VUs  2m59.9s/3m00.0s


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=97.19ms


  █ TOTAL RESULTS 

    checks_total.......: 94452   524.643723/s
    checks_succeeded...: 100.00% 94452 out of 94452
    checks_failed......: 0.00%   0 out of 94452

    ✓ status 200

    CUSTOM
    approved_transactions..........: 9903   55.007271/s
    error_rate.....................: 0.00%  0 out of 134852
    rejected_transactions..........: 84549  469.636451/s

    HTTP
    http_req_duration..............: avg=26.04ms  min=687.54µs med=10.43ms  max=469.28ms p(90)=69.27ms  p(95)=97.19ms 
      { expected_response:true }...: avg=26.04ms  min=687.54µs med=10.43ms  max=469.28ms p(90)=69.27ms  p(95)=97.19ms 
    http_req_failed................: 0.00%  0 out of 134857
    http_reqs......................: 134857 749.077611/s

    EXECUTION
    iteration_duration.............: avg=127.63ms min=100.84ms med=111.56ms max=659.02ms p(90)=172.73ms p(95)=201.34ms
    iterations.....................: 134852 749.049838/s
    vus............................: 2      min=2           max=199
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 40 MB  221 kB/s
    data_sent......................: 22 MB  123 kB/s



running (3m00.0s), 000/200 VUs, 134852 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  3m0s